rails/app/controllers/comments_controller.rb

	def comment
		@comment = Comment.build_from(@recipe, 1, params[:body])
		@comment.save
---
INSERT INTO `comments` (`commentable_id`, `commentable_type`, `body`, `user_id`, `created_at`, `updated_at`, `lft`, `rgt`) VALUES (1, 'Recipe', '\"This is a comment\"', 1, '2015-12-15 12:18:38', '2015-12-15 12:18:38', 1, 2)

	def set_comment
		@recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1