rails/app/controllers/recipes_controller.rb

	def index
		respond_with @posts = Recipe.all
---
SELECT `recipes`.* FROM `recipes`  ORDER BY `recipes`.`created_at` DESC

	def create
		@recipe = Recipe.new(recipe_params)
		@recipe.save
---
INSERT INTO `recipes` (`name`, `description`, `preparation`, `target_user`, `user_name`, `created_at`, `updated_at`) VALUES ('My First Recipe', 'Very Tasty', 'And Nice', 3, 'CookBook12345', '2015-12-16 06:07:48', '2015-12-16 06:07:48')

    def set_post
    	@recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1