rails/app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
	def index
		respond_with @users = User.all

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`user_id` = 1
---
	def posts
		respond_with @recipes = Recipe.where(user_id: @user.id)